rails/trading/app/controllers/traders_controller.rb

INSERT INTO "traders" ("name", "email", "balance", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Amanda Rosales"], ["email", "amanda.rosales89@hotmail.com"], ["balance", 23.6], ["created_at", "2025-04-09 20:07:08.428374"], ["updated_at", "2025-04-09 20:07:08.428374"]]
---
  def register
    trader = Trader.new(trader_params)

    if trader.save

SELECT "traders".* FROM "traders" WHERE "traders"."email" = ? LIMIT ?  [["email", "non.existing@email.com"], ["LIMIT", 1]]
---
  def find
    trader = Trader.find_by(email: params[:email])

SELECT "traders".* FROM "traders" WHERE "traders"."email" = ? LIMIT ?  [["email", "non.existing@email.com"], ["LIMIT", 1]]
---
  def update
    trader = Trader.find_by(email: params[:email])

SELECT "traders".* FROM "traders" WHERE "traders"."email" = ? LIMIT ?  [["email", "non.existing@email.com"], ["LIMIT", 1]]
---
  def add
    trader = Trader.find_by(email: params[:email])